Catalogs/ПозицииКадровогоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПозицииКадровогоПлана</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиКадровогоПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКадровогоПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ПоказателиКадровогоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПоказателиКадровогоПлана</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимаяВакансия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПозицииКадровогоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиКадровогоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПозицииШтатногоРасписанияПоКадровомуПлану.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПозицииШтатногоРасписанияПоКадровомуПлану</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПозицияКадровогоПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПозицииКадровогоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПозицииКадровогоПлана/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИнформационнаяСтрокаЗанятости", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаИнформационныхСтрокЗанятости()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Сценарий", Новый ОписаниеТипов("СправочникСсылка.Сценарии"));
	Таблица.Колонки.Добавить("КоличествоСтавок", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ЗапланированоСтавок", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ЗанятоСтавок", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ЗанятоСотрудниками", Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("ИнформационнаяСтрокаЗанятости", Новый ОписаниеТипов("ФорматированнаяСтрока"));
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗаполнитьИнформационныеСтрокиЗанятости(ТаблицаИнформационныхСтрок, ДанныеПозиции)
	
	Запрос = Новый Запрос;
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ТекущаяДата));
	Запрос.УстановитьПараметр("Позиция", ДанныеПозиции.Позиция);
	Запрос.УстановитьПараметр("Показатель", КадровоеПланирование.ПоказательКоличествоСтавок());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&Позиция КАК ПозицияКадровогоПлана
		|ПОМЕСТИТЬ ВТПозицииКадровогоПлана
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиКадровогоПлана.Сценарий КАК Сценарий,
		|	СУММА(ЕСТЬNULL(ПоказателиКадровогоПлана.Значение, 0)) КАК ЗапланированоСтавок
		|ИЗ
		|	ВТПозицииКадровогоПлана КАК ПозицииКадровогоПлана
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
		|		ПО ПозицииКадровогоПлана.ПозицияКадровогоПлана = ПоказателиКадровогоПлана.Позиция
		|			И (ПоказателиКадровогоПлана.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (ПоказателиКадровогоПлана.Показатель = &Показатель)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиКадровогоПлана.Сценарий";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаИнформационныхСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	// Составляем перечень связанных позиций ШР с позицией кадрового плана.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПозицияКадровогоПлана", ДанныеПозиции.Позиция);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания
		|ИЗ
		|	РегистрСведений.ПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииШтатногоРасписания
		|ГДЕ
		|	ПозицииШтатногоРасписания.ПозицияКадровогоПлана = &ПозицияКадровогоПлана";
	
	ПозицииШтатногоРасписания = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПозицияШтатногоРасписания");
	
	Если ПозицииШтатногоРасписания.Количество() = 0 Тогда
		Для Каждого СтрокаИнформации Из ТаблицаИнформационныхСтрок Цикл
			КадровоеПланирование.ЗаполнитьИнформационнуюСтрокуЗанятости(СтрокаИнформации);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	// Получаем сотрудников, работающих на связанных позициях ШР.
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ДолжностьПоШтатномуРасписанию", "В", ПозицииШтатногоРасписания);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ДатаУвольнения", "=", Дата(1, 1, 1));
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыЗапроса);
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗанятоСтавок = СотрудникиОрганизации.Количество();
	Сотрудники = СотрудникиОрганизации.ВыгрузитьКолонку("Сотрудник");
	КоличествоСтавокШР = КоличествоСтавокШтатногоРасписания(ПозицииШтатногоРасписания);
	
	Для Каждого СтрокаИнформации Из ТаблицаИнформационныхСтрок Цикл
		СтрокаИнформации.ЗанятоСтавок = ЗанятоСтавок;
		СтрокаИнформации.ЗанятоСотрудниками = Сотрудники;
		СтрокаИнформации.КоличествоСтавок = КоличествоСтавокШР;
		КадровоеПланирование.ЗаполнитьИнформационнуюСтрокуЗанятости(СтрокаИнформации);
	КонецЦикла;
		
КонецПроцедуры

Функция ИнформационнаяСтрокаЗанятости(ДанныеПозиции) Экспорт
	
	ТаблицаИнформационныхСтрок = ТаблицаИнформационныхСтрокЗанятости();
	ЗаполнитьИнформационныеСтрокиЗанятости(ТаблицаИнформационныхСтрок, ДанныеПозиции);
	
	Если ТаблицаИнформационныхСтрок.Количество() = 0 Тогда
		ТаблицаИнформационныхСтрок.Добавить();
	КонецЕсли;
	
	ЧастиНадписи = Новый Массив;
	Для Каждого Строка Из ТаблицаИнформационныхСтрок Цикл
		Если ЧастиНадписи.Количество() > 0 Тогда
			ЧастиНадписи.Добавить(Символы.ПС);
		КонецЕсли;
		ЧастиНадписи.Добавить(Строка.ИнформационнаяСтрокаЗанятости);
	КонецЦикла;
	
	Возврат Новый Структура("ИнформационнаяСтрокаЗанятости", Новый ФорматированнаяСтрока(ЧастиНадписи));
	
КонецФункции

Функция КоличествоСтавокШтатногоРасписания(ПозицииШтатногоРасписания)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(
		ОбщегоНазначения.ТекущаяДатаПользователя(), , , ПозицииШтатногоРасписания);
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения, "КоличествоСтавок");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ПозицииШтатногоРасписания.КоличествоСтавок) КАК КоличествоСтавок
		|ИЗ
		|	ВТШтатноеРасписание КАК ПозицииШтатногоРасписания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоСтавок;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли
